tutorials/heatTransfer/buoyantSimpleFoam/circuitBoardCooling/system/baffleRegion/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    T
    {
        boundaryField
        {
            "region0_to.*"
            {
                type                compressible::temperatureThermoBaffle;
                neighbourFieldName  T;
                K                   solidThermo;
                KName               none;

                value               uniform 300;
            }
            baffleFaces2_side
            {
                type            zeroGradient;
            }
            floor
            {
                type            fixedValue;
                value           uniform 300;
            }
            fixedWalls
            {
                type            empty;
            }
        }
    }

    boundary
    {
        floor
        {
            type        patch;
        }
    }
}

// ************************************************************************* //
